# Задание 16-2
import re
s = '4 67 -32 6544 34 76 2 7 0 765 45'
x = int(input('Введите двузначное число: '))
if len(str(x)) == 2:
    print(re.findall(rf'\b\d\b|\s[0-{(x // 10) - 1}][0-9]|\s[{x // 10}][0-{x % 10}]', s))
else:
    print('Ошибка: не двузначное число')